In [1]:
import xgboost as xgb
import pandas as pd
import numpy as np

In [2]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
total=pd.concat([train,test])
print str(len(train))+":"+str(len(test))
total.info()

891:418
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [12]:
total.loc[total['Fare'].isnull()]

    Age  Embarked Fare  Pclass  Sex  Survived  FamilySize  IsAlone
258   2         1  NaN       1    0       1.0           1        1
679   2         1  NaN       1    1       1.0           2        0
737   2         1  NaN       1    1       1.0           1        1
343   3         1  NaN       1    0       NaN           2        0

In [5]:
#train[['Sex','Survived']].groupby(['Sex'], as_index=False).mean()
total['FamilySize']=total['SibSp']+total['Parch']+1
#total[['FamilySize','Survived']].groupby(['FamilySize'], as_index=False).mean()

In [6]:
total['IsAlone']=1
total.loc[total['FamilySize']>1, 'IsAlone']=0
#total[['IsAlone','Survived']].groupby(['IsAlone'], as_index=False).mean()

In [7]:
total['Embarked'].fillna('S',inplace=True)
total[['Embarked','Survived']].groupby('Embarked', as_index=False).mean()

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [8]:
total['Fare'].fillna(total['Fare'].median(),inplace=True)
total['FareCategorical']=pd.qcut(total['Fare'],4)
total[['FareCategorical','Survived']].groupby('FareCategorical', as_index=False).mean()

     FareCategorical  Survived
0    (-0.001, 7.896]  0.197309
1    (7.896, 14.454]  0.303571
2   (14.454, 31.275]  0.441048
3  (31.275, 512.329]  0.600000

In [9]:
mu=total['Age'].mean()
delta=total['Age'].std()
rand_list=np.random.randint(mu-delta,mu+delta,size=total['Age'].isnull().sum())
total.loc[total['Age'].isnull(), 'Age']=rand_list
total['Age']=total['Age'].astype(int)
total['AgeCategorical']=pd.cut(total['Age'],5)
total[['AgeCategorical','Survived']].groupby('AgeCategorical', as_index=False).mean()

  AgeCategorical  Survived
0  (-0.08, 16.0]  0.508929
1   (16.0, 32.0]  0.365079
2   (32.0, 48.0]  0.360465
3   (48.0, 64.0]  0.434783
4   (64.0, 80.0]  0.090909

In [10]:
total.drop('PassengerId',axis=1,inplace=True)
total.drop('Name',axis=1,inplace=True)
total.drop('Cabin',axis=1,inplace=True)
total.drop('SibSp',axis=1,inplace=True)
total.drop('Parch',axis=1,inplace=True)
total.drop('Ticket',axis=1,inplace=True)
total.drop('FareCategorical',axis=1,inplace=True)
total.drop('AgeCategorical',axis=1,inplace=True)


age_bins=[-1,16,32,48,64,80]
total['Age'] = pd.cut(total['Age'],age_bins , labels=range(len(age_bins)-1)) 

fare_bins=[-0.008,7.896,14.454,31.275,512.329]
total['Fare']=pd.cut(total['Fare'], fare_bins, labels=range(len(fare_bins)-1))


total['Embarked']=total['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2 }).astype(int)
total['Sex']=total['Sex'].map( { 'female' : 0 , 'male' : 1 } ).astype(int)

In [11]:
total.head(5)

  Age  Embarked Fare  Pclass  Sex  Survived  FamilySize  IsAlone
0   1         0    0       3    1       0.0           2        0
1   2         1    3       1    0       1.0           2        0
2   1         0    1       3    0       1.0           1        1
3   2         0    3       1    0       1.0           2        0
4   2         0    1       3    1       0.0           1        1